window.noname_update = {
	version: "1.2.1",
	update: "1.2.1",
	changeLog: [
		"增加bp可选角色数",
		"增加自选士气最大值、战绩最大值、星杯最大值设置",
		"修复联机多控技能偶发不能释放",
		"优化事件中对控切换角色代码",
		"优化联机多控，切换角色时切换呢称",
		"调整合成优先级初始值为3.25",
		"修复刃、史书攻击无音效，调整攻击音效播放",
		"修复联机多控无法正常创建录像",
		"优化神官神圣契约ai",
		"修复合成ai优先级错误计算",
		"优化提炼ai,降低战绩区数量带来的优先级",
		"优化开启多控后将不在显示队友手牌显示设置",
		"修复弥撒无法触发事奉",
		"修复噬神者异刃无法切换系别",
		"优化bp和cm代码",
		"修复多控bp和cm选角后未初始化多控面板角色图",
		"修复bp和cm选角模式下ban/选阿斯兰导致另一状态可选的oug",
		"修复联机多控重连后未初始化多控面板角色图",
		"优化联机创房选项显示",
		"修复联机创建房间后可再次更改房间对控设置",
	],
	files: [

	],
};
