window.noname_update = {
	version: "1.1.2",
	update: "1.1.2", 
	changeLog: [
		'修复联机时异教徒翻面预言弃牌时导致卡顿',
		'修复铁律者和红衣主教可以同框',
		'统一抵御伤害代码',
		'规范弃牌展示代码',
		'discard中的showCards事件增加discard布尔属性用于部分技能判断',
		'优化魔女之怒展示牌部分',
		'优化魔女之怒ai',
		'完善回合限定括号使用',
		'修复军神威光选择选项时错误文字',
		'修复打出刃攻击命中可以触发秘术幕影',
		'修复铸律者错误名字',
		'需要可以先发动气绝崩击再发动蓄力一击的bug',
		'修复在特定情况下封印可多次触发的bug',
		'增加新手向导',
		"优化圣光价值",
		"修复录像下无法查看盖牌和无法正常查看手牌",
		"优化蝶舞者凋零ai与魔剑士无法行动相关ai",
		"优化作弊函数",
		"修复蝶舞者对染污者造成伤害伤害结算bug",
		'优化在线更新',
	],
	files: [

	],
};
