window.noname_update = {
	version: "1.5.2",
	update: "1.5.2",
	changeLog: [
		"更新boss模式buffBCD为最新效果",
		"修改boss模式将会调整冥界左右拳实际位置",
		"修复game.swapSeata参数behind未正常生效，理应调至下家",
		"更新boss模式buff炼金术，删除增加战绩上限",
		"更新冥界boss破防形态技能，固定增加+2瘴气",
		"修复传教士神的门徒插入回合时机",
		"修复角色手牌提示栏未显示牌原始信息",
		"修复角色横置时手牌手牌提示栏位置会随手牌数变化，增加对木纹主题的兼容",
		"修复联机多控重新入局报错",
		"修复boss模式联机多控开局未显示拳的手牌",
		"修复boss模式联机获得星杯无法获得buff",
		"修复boss模式左右拳在队友满手时购买合成本体可以发动御衡",
		"更改boss名称显示",
		"修复传教士神的门徒id错误",
		"修复boss模式御衡不对左右拳生效",
		"将星杯传说模式名改为单机",
		"修复启动页为样式二时，boss模式图片素材为正常显示",
		"修复boss模式先驱法杖、攻击号令buf士气未额外下降，以及更新素材",
	],
	files: [

	],
};
